---
kind: method
id: M:Autodesk.Revit.DB.SolidCurveIntersectionOptions.#ctor
source: html/7e2c802b-230d-49a6-fee6-6a79820bdf46.htm
---
# Autodesk.Revit.DB.SolidCurveIntersectionOptions.#ctor Method

Constructs a new SolidCurveIntersectionMode with default settings.

## Syntax (C#)
```csharp
public SolidCurveIntersectionOptions()
```